 
import '../Main.css';
 
import elip1 from '../imgs/Ellipse 1.png'
import elip2 from '../imgs/Ellipse 2.png'
import elip3 from '../imgs/Ellipse 3.png'
import elip4 from '../imgs/Ellipse 5.png'
import elip5 from '../imgs/Ellipse 4.png'

 
import aboutHospital from '../imgs/about_hospital.png'
import aboutLogo from '../imgs/about_logo.png'
import tech_bg from '../imgs/tech_bg.png'
import tech_up from '../imgs/bg__up.png'
 
 

 
 
import 'swiper/css';
import { useNavigate } from 'react-router-dom';
import Header from '../components/Header';
 
import ItemServices from '../components/ItemServices';
import Slider from '../components/Slider';
import { useRef } from 'react';
import NewsReviews from '../components/NewsReviews';

 


function Main() {
	const navigate = useNavigate()

	const about = useRef(null)
	const technologies = useRef(null)
	const services = useRef(null)
	const map = useRef(null)
	const send = useRef(null)
	const reviews = useRef(null)



	 
  return (
	<section className='container'>
		<img className='elip1' src={elip1} alt="logo" />
		<img className='elip2' src={elip2} alt="logo" />

		<Header isMain={true} reviews={reviews} news={reviews} services={services} map={map} send={send} />	
	
		<div className='welcome__overlay'>

		</div>
		<section className='welcome__section'>
			<div>
				 

			</div>

			<div className='relative'>
			 	<Slider />
				<section className='main__container'>
					<div className=' welcome__title_wrapper'>
								
								<h1>Медицинские Консультации По <span>Любому</span> Вопросу</h1>
								<div className='welcome__title_description'>
									<hr />
									<p>Дополнительное описание услуги, товара, работника или какого-либо блока на сайте</p>
									<button onClick={() => {
										about.current.scrollIntoView({behavior: "smooth"})
									}}>ПОДРОБНЕЕ ОБ УСЛУГАХ <div>
										<svg width="11" height="8" viewBox="0 0 11 8" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path d="M0.244154 0.330294C-0.0813845 0.765193 -0.0813845 1.47027 0.244154 1.90528L4.32221 7.34839C4.9734 8.2175 6.02855 8.21716 6.67932 7.34762L10.7559 1.90127C11.0814 1.46626 11.0814 0.761183 10.7559 0.326174C10.4304 -0.108725 9.90253 -0.108725 9.57702 0.326174L6.0879 4.98777C5.76239 5.42269 5.23465 5.42269 4.90905 4.98777L1.42301 0.330294C1.09748 -0.104715 0.569683 -0.104715 0.244154 0.330294Z" fill="white"/>
										</svg>
										</div> 
									</button>
								</div>
								<div className='welcome__title_description shadow'>
								</div>
					</div>

				
				</section>
				<div className='welcome__subdescription'>
					<svg className='sub__dots' width="28" height="36" viewBox="0 0 28 36" fill="none" xmlns="http://www.w3.org/2000/svg">
						<circle cx="3" cy="3" r="3" fill="white"/>
						<circle cx="25" cy="3" r="3" fill="white"/>
						<circle cx="14" cy="3" r="3" fill="white"/>
						<circle cx="3" cy="13" r="3" fill="white"/>
						<circle cx="25" cy="13" r="3" fill="white"/>
						<circle cx="14" cy="13" r="3" fill="white"/>
						<circle cx="3" cy="23" r="3" fill="white"/>
						<circle cx="14" cy="23" r="3" fill="white"/>
						<circle cx="3" cy="33" r="3" fill="white"/>
						<circle cx="14" cy="33" r="3" fill="white"/>
					</svg>
					<svg className='sub__corner_one' width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
						<line y1="1.50012" x2="37.0135" y2="1.50012" stroke="white" strokeWidth="2"/>
						<line x1="1.00677" y1="39.0135" x2="1.00677" y2="2.00004" stroke="white" strokeWidth="2"/>
					</svg>
					<svg className='sub__corner_two' width="38" height="37" viewBox="0 0 38 37" fill="none" xmlns="http://www.w3.org/2000/svg">
						<line x1="37" y1="36" y2="36" stroke="white" strokeWidth="2"/>
						<line x1="37" x2="37" y2="37" stroke="white" strokeWidth="2"/>
					</svg>

					<h6>Передовые Технологии Обследования</h6>
					<p>Дополнительное описание <span>услуги</span>, товара, работника или <br/> какого-либо блока <span>на сайте</span></p>
				</div>
			</div>
			 
		</section>
	 

		<section ref={about} className='main__about'>
				<img className='elip3' src={elip3} alt="logo" />
	 
				<img className='elip4' src={elip4} alt="logo" />
				<img className='elip5' src={elip5} alt="logo" />

				<img className='elip6' src={elip4} alt="logo" />
				<img className='elip7' src={elip3} alt="logo" />

				<img className='elip8' src={elip5} alt="logo" />

			<div className='main__about_wrapper'>
				<div className='welcome__subdescription mobile__sub'>
						<svg className='sub__dots' width="28" height="36" viewBox="0 0 28 36" fill="none" xmlns="http://www.w3.org/2000/svg">
							<circle cx="3" cy="3" r="3" fill="white"/>
							<circle cx="25" cy="3" r="3" fill="white"/>
							<circle cx="14" cy="3" r="3" fill="white"/>
							<circle cx="3" cy="13" r="3" fill="white"/>
							<circle cx="25" cy="13" r="3" fill="white"/>
							<circle cx="14" cy="13" r="3" fill="white"/>
							<circle cx="3" cy="23" r="3" fill="white"/>
							<circle cx="14" cy="23" r="3" fill="white"/>
							<circle cx="3" cy="33" r="3" fill="white"/>
							<circle cx="14" cy="33" r="3" fill="white"/>
						</svg>
						<svg className='sub__corner_one' width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
							<line y1="1.50012" x2="37.0135" y2="1.50012" stroke="white" strokeWidth="2"/>
							<line x1="1.00677" y1="39.0135" x2="1.00677" y2="2.00004" stroke="white" strokeWidth="2"/>
						</svg>
						<svg className='sub__corner_two' width="38" height="37" viewBox="0 0 38 37" fill="none" xmlns="http://www.w3.org/2000/svg">
							<line x1="37" y1="36" y2="36" stroke="white" strokeWidth="2"/>
							<line x1="37" x2="37" y2="37" stroke="white" strokeWidth="2"/>
						</svg>

						<h6>Передовые Технологии Обследования</h6>
						<p>Дополнительное описание <span>услуги</span>, товара, работника или <br/> какого-либо блока <span>на сайте</span></p>
					</div>
				


				<div className='line__wrapper'>
					<p>ЦИТАТА ИЛИ ПРОСТО ТЕКСТ</p>
					<svg width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
						<g clipPath="url(#clip0_20_61)">
						<path d="M27.3889 6.44442H20.9444V3.2222C20.9444 2.33105 20.2245 1.61108 19.3333 1.61108H9.66667C8.77552 1.61108 8.05556 2.33105 8.05556 3.2222V6.44442H1.61111C0.719965 6.44442 0 7.16438 0 8.05553V26.5833C0 27.0264 0.3625 27.3889 0.805556 27.3889H28.1944C28.6375 27.3889 29 27.0264 29 26.5833V8.05553C29 7.16438 28.28 6.44442 27.3889 6.44442ZM8.05556 23.5625C8.05556 23.8948 7.78368 24.1666 7.45139 24.1666H5.4375C5.10521 24.1666 4.83333 23.8948 4.83333 23.5625V21.5486C4.83333 21.2163 5.10521 20.9444 5.4375 20.9444H7.45139C7.78368 20.9444 8.05556 21.2163 8.05556 21.5486V23.5625ZM8.05556 17.118C8.05556 17.4503 7.78368 17.7222 7.45139 17.7222H5.4375C5.10521 17.7222 4.83333 17.4503 4.83333 17.118V15.1041C4.83333 14.7718 5.10521 14.5 5.4375 14.5H7.45139C7.78368 14.5 8.05556 14.7718 8.05556 15.1041V17.118ZM16.1111 23.5625C16.1111 23.8948 15.8392 24.1666 15.5069 24.1666H13.4931C13.1608 24.1666 12.8889 23.8948 12.8889 23.5625V21.5486C12.8889 21.2163 13.1608 20.9444 13.4931 20.9444H15.5069C15.8392 20.9444 16.1111 21.2163 16.1111 21.5486V23.5625ZM16.1111 17.118C16.1111 17.4503 15.8392 17.7222 15.5069 17.7222H13.4931C13.1608 17.7222 12.8889 17.4503 12.8889 17.118V15.1041C12.8889 14.7718 13.1608 14.5 13.4931 14.5H15.5069C15.8392 14.5 16.1111 14.7718 16.1111 15.1041V17.118ZM16.9167 8.559C16.9167 8.72515 16.7807 8.86108 16.6146 8.86108H15.3056V10.1701C15.3056 10.3363 15.1696 10.4722 15.0035 10.4722H13.9965C13.8304 10.4722 13.6944 10.3363 13.6944 10.1701V8.86108H12.3854C12.2193 8.86108 12.0833 8.72515 12.0833 8.559V7.55206C12.0833 7.38591 12.2193 7.24997 12.3854 7.24997H13.6944V5.94095C13.6944 5.7748 13.8304 5.63886 13.9965 5.63886H15.0035C15.1696 5.63886 15.3056 5.7748 15.3056 5.94095V7.24997H16.6146C16.7807 7.24997 16.9167 7.38591 16.9167 7.55206V8.559ZM24.1667 23.5625C24.1667 23.8948 23.8948 24.1666 23.5625 24.1666H21.5486C21.2163 24.1666 20.9444 23.8948 20.9444 23.5625V21.5486C20.9444 21.2163 21.2163 20.9444 21.5486 20.9444H23.5625C23.8948 20.9444 24.1667 21.2163 24.1667 21.5486V23.5625ZM24.1667 17.118C24.1667 17.4503 23.8948 17.7222 23.5625 17.7222H21.5486C21.2163 17.7222 20.9444 17.4503 20.9444 17.118V15.1041C20.9444 14.7718 21.2163 14.5 21.5486 14.5H23.5625C23.8948 14.5 24.1667 14.7718 24.1667 15.1041V17.118Z" fill="white"/>
						</g>
						<defs>
						<clipPath id="clip0_20_61">
						<rect width="29" height="29" fill="white"/>
						</clipPath>
						</defs>
					</svg>
					<p>MED CLINIC</p>
					

				</div>
				<div className='about__hospital'>
					<img src={aboutHospital} alt="about__img" />
					<svg width="405" height="278" viewBox="0 0 405 278" fill="none" xmlns="http://www.w3.org/2000/svg">
						<g filter="url(#filter0_d_20_45)">
						<path fillRule="evenodd" clipRule="evenodd" d="M4 3.01823V240C4 256.568 17.4315 270 34 270H400.371V0.323242C373.835 84.7578 294.946 146 201.752 146C109.553 146 31.3539 86.0578 4 3.01823Z" fill="white"/>
						</g>
						<defs>
						<filter id="filter0_d_20_45" x="0" y="0.323242" width="404.371" height="277.677" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
						<feFlood floodOpacity="0" result="BackgroundImageFix"/>
						<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
						<feOffset dy="4"/>
						<feGaussianBlur stdDeviation="2"/>
						<feComposite in2="hardAlpha" operator="out"/>
						<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
						<feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_20_45"/>
						<feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_20_45" result="shape"/>
						</filter>
						</defs>
					</svg>
					<div>
						<p className='additional__text'>
							Дополнительный текст с каким либо значением текст с каким либо значением
						</p>
						 
					</div>

				</div>

				<div className='about__description'>

					<svg width="602" height="868" viewBox="0 0 602 868" fill="none" xmlns="http://www.w3.org/2000/svg">
						<g filter="url(#filter0_bd_15_217)">
						<path fillRule="evenodd" clipRule="evenodd" d="M4 0H31L578 0.00023592C589.046 0.00024046 598 8.95455 598 20.0002V703.5C598 714.546 589.046 723.5 578 723.5H306.505C295.46 723.5 286.505 732.455 286.505 743.5V840C286.505 851.046 277.551 860 266.505 860H24.0001C23.9668 860 23.9335 860 23.9002 860H4V832H4.00007V450L4 28V0Z" fill="white"/>
						</g>
						<defs>
						<filter id="filter0_bd_15_217" x="-6" y="-10" width="614" height="880" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
						<feFlood floodOpacity="0" result="BackgroundImageFix"/>
						<feGaussianBlur in="BackgroundImageFix" stdDeviation="5"/>
						<feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_15_217"/>
						<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
						<feOffset dy="4"/>
						<feGaussianBlur stdDeviation="2"/>
						<feComposite in2="hardAlpha" operator="out"/>
						<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
						<feBlend mode="normal" in2="effect1_backgroundBlur_15_217" result="effect2_dropShadow_15_217"/>
						<feBlend mode="normal" in="SourceGraphic" in2="effect2_dropShadow_15_217" result="shape"/>
						</filter>
						</defs>
					</svg>

					<div className='wrapper__desc'>
 
						<h6>О Нас</h6>
						<p>Дополнительный текст с каким либо значением текст с каким либо значением Дополнительный текст с каким либо значением текст с каким либо значением </p>
						<img src={aboutLogo} alt="aboutLogo" />
						<p className='add__text_last'>Дополнительный текст с каким либо значением текст с каким либо значением  Дополнительный текст  с каким либо значением текст <br/> с каким либо значением 
							Дополнительный текст с каким  либо значением текст <br/> с каким либо значением <br/> Дополнительный текст  
							<br/> Дополнительный текст  
							 
						 
						</p>
						<div className='about__dots'>
							<div className='about__dot'>

							</div>
							<div className='about__line_dot'> </div>
							<div className='about__dot'>

							</div>
						</div>
						<div className='about__dots left__dots_about'>
							<div className='about__dot'>

							</div>
							<div className='about__line_dot'> </div>
							<div className='about__dot'>

							</div>
						</div>
						<button onClick={() => {
							technologies.current.scrollIntoView({behavior: "smooth"})
						}}  className='additional__button'>
							Подробнее 
							<div>
								<svg width="13" height="11" viewBox="0 0 13 11" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M0.288545 0.414124C-0.0961817 0.959434 -0.0961817 1.84352 0.288545 2.38897L5.10807 9.21396C5.87766 10.3037 7.12465 10.3033 7.89375 9.213L12.7115 2.38394C13.0962 1.83849 13.0962 0.954406 12.7115 0.408956C12.3268 -0.136354 11.703 -0.136354 11.3183 0.408956L7.19479 6.25404C6.81009 6.79938 6.1864 6.79938 5.80161 6.25404L1.68174 0.414124C1.29702 -0.131327 0.673262 -0.131327 0.288545 0.414124Z" fill="black"/>
								</svg>


							</div>
						</button>

						<svg className='corner__additional' width="38" height="37" viewBox="0 0 38 37" fill="none" xmlns="http://www.w3.org/2000/svg">
							<line x1="37" y1="36" y2="36" stroke="white" strokeWidth="2"/>
							<line x1="37" x2="37" y2="37" stroke="white" strokeWidth="2"/>
						</svg>
				 

					</div>



				</div>
				<div className='additional__wrapper'>
					 
					<div className='additional__inner'>
						<h6>Дополнительная Секция</h6>
						<hr className='line__additional_inner' />
						<div className='additional__block_modal'>
							<h6>Дополнительная Секция</h6>
							<p>
								Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо 

							</p>
						</div>
						<div className='additional__block_modal add__modal_additional'>
							<p>
								Дополнительный текст с каким либо значением  текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо 

							</p>
						</div>
						<svg className='additional__circles' width="28" height="36" viewBox="0 0 28 36" fill="none" xmlns="http://www.w3.org/2000/svg">
							<circle cx="3" cy="3" r="3" fill="#1F5D6C"/>
							<circle cx="25" cy="3" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="3" r="3" fill="#1F5D6C"/>
							<circle cx="3" cy="13" r="3" fill="#1F5D6C"/>
							<circle cx="25" cy="13" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="13" r="3" fill="#1F5D6C"/>
							<circle cx="3" cy="23" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="23" r="3" fill="#1F5D6C"/>
							<circle cx="3" cy="33" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="33" r="3" fill="#1F5D6C"/>
						</svg>
						<svg className='additional__circlesTwo' width="28" height="36" viewBox="0 0 28 36" fill="none" xmlns="http://www.w3.org/2000/svg">
							<circle cx="3" cy="3" r="3" fill="#1F5D6C"/>
							<circle cx="25" cy="3" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="3" r="3" fill="#1F5D6C"/>
							<circle cx="3" cy="13" r="3" fill="#1F5D6C"/>
							<circle cx="25" cy="13" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="13" r="3" fill="#1F5D6C"/>
							<circle cx="3" cy="23" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="23" r="3" fill="#1F5D6C"/>
							<circle cx="3" cy="33" r="3" fill="#1F5D6C"/>
							<circle cx="14" cy="33" r="3" fill="#1F5D6C"/>
						</svg>
					</div>
					<div className='additional__end'>
						<p>Место для какого либо уточнения или просто дополнительного текста</p>
					</div>
					 

				</div>
				<div className='welcome__title_description shadow index__welcomeFR'>
				</div>
				<div className='welcome__title_description shadow index__welcome'>
				</div>
				 
			</div>

			<div className='technologies' ref={technologies}>
			<img className='elip4' src={elip4} alt="logo" />
			<img className='elip3' src={elip3} alt="logo" />
				<p className='techno__bg_text'><span>ТЕХ</span>НОЛОГИ<span>И</span></p>
				<img className='bg__tech' src={tech_bg} alt="tech_bg" />
				<img className='bg__tech_up' src={tech_up} alt="tech_up" />
				<div className='hr__tech' ></div>
				<div className='tech__wrapper_desc'>
					<div className='tech__bg_svg'>
						<svg className='tech__block'  width="524" height="719" viewBox="0 0 524 719" fill="none" xmlns="http://www.w3.org/2000/svg">
							<g filter="url(#filter0_bd_64_3)">
							<rect x="23.5" y="0.5" width="496" height="710" rx="19.5" stroke="white" shapeRendering="crispEdges"/>
							</g>
							<g filter="url(#filter1_bd_64_3)">
							<path d="M4 40.1322C4 29.035 13.0348 20.0595 24.1318 20.1326L368.132 22.399C379.126 22.4714 388 31.4042 388 42.3985V58.1866C388 69.2323 396.954 78.1866 408 78.1866H484C495.046 78.1866 504 87.1409 504 98.1866V678C504 689.046 495.046 698 484 698H24C12.9543 698 4 689.046 4 678V40.1322Z" fill="white"/>
							<path d="M4.5 40.1322C4.5 29.3124 13.3089 20.5613 24.1285 20.6326L368.128 22.8989C378.848 22.9696 387.5 31.6791 387.5 42.3985V58.1866C387.5 69.5084 396.678 78.6866 408 78.6866H484C494.77 78.6866 503.5 87.417 503.5 98.1866V678C503.5 688.77 494.77 697.5 484 697.5H24C13.2305 697.5 4.5 688.77 4.5 678V40.1322Z" stroke="url(#paint0_linear_64_3)"/>
							</g>
							<defs>
							<filter id="filter0_bd_64_3" x="13" y="-10" width="517" height="731" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
							<feFlood floodOpacity="0" result="BackgroundImageFix"/>
							<feGaussianBlur in="BackgroundImageFix" stdDeviation="5"/>
							<feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_64_3"/>
							<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
							<feOffset dy="4"/>
							<feGaussianBlur stdDeviation="2"/>
							<feComposite in2="hardAlpha" operator="out"/>
							<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
							<feBlend mode="normal" in2="effect1_backgroundBlur_64_3" result="effect2_dropShadow_64_3"/>
							<feBlend mode="normal" in="SourceGraphic" in2="effect2_dropShadow_64_3" result="shape"/>
							</filter>
							<filter id="filter1_bd_64_3" x="-6" y="10.1322" width="520" height="697.868" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
							<feFlood floodOpacity="0" result="BackgroundImageFix"/>
							<feGaussianBlur in="BackgroundImageFix" stdDeviation="5"/>
							<feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_64_3"/>
							<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
							<feOffset dy="4"/>
							<feGaussianBlur stdDeviation="2"/>
							<feComposite in2="hardAlpha" operator="out"/>
							<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
							<feBlend mode="normal" in2="effect1_backgroundBlur_64_3" result="effect2_dropShadow_64_3"/>
							<feBlend mode="normal" in="SourceGraphic" in2="effect2_dropShadow_64_3" result="shape"/>
							</filter>
							<linearGradient id="paint0_linear_64_3" x1="495" y1="298.93" x2="22.2014" y2="325.762" gradientUnits="userSpaceOnUse">
							<stop/>
							<stop offset="1" stopColor="#666666" stopOpacity="0"/>
							</linearGradient>
							</defs>
						</svg>
					 
						<div className='overlay__tech'>
							<h6>Цитата Или Просто Текст</h6>
							<p>Дополнительный текст с каким либо значением текст с каким либо значением </p>
						</div>
						<div className='tech__wrapper'>
							<h6>Новейшие <span>Технологии</span></h6>
							<p>
								Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо значением Дополнительный текст с каким либо  текст с каким либо Дополнительный текст 

							</p>
							<div className='tech__num'>
								<h6>01 -</h6>
								<p>Дополнительный текст с каким либо значением Дополнительный текст с каким 
								</p>
							</div>
							<div className='tech__num'>
								<h6>02 -</h6>
								<p>Дополнительный текст с каким либо значением Дополнительный текст с каким 
								</p>
							</div>
							<div className='tech__num'>
								<h6>03 -</h6>
								<p>Дополнительный текст с каким либо значением Дополнительный текст с каким 
								</p>
							</div>
						</div>
						<svg className='tech__corner' width="37" height="39" viewBox="0 0 37 39" fill="none" xmlns="http://www.w3.org/2000/svg">
							<line y1="-1" x2="37" y2="-1" transform="matrix(1 0 0 -1 0 36.5001)" stroke="white" strokeWidth="2"/>
							<line y1="-1" x2="37" y2="-1" transform="matrix(0 1 1 0 2.0061 0)" stroke="white" strokeWidth="2"/>
							</svg>
						<button onClick={() => {
							services.current.scrollIntoView({behavior: "smooth"})
						}}  className='additional__button tech__button'>
							Дальше 
							<div>
								<svg width="13" height="11" viewBox="0 0 13 11" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M0.288545 0.414124C-0.0961817 0.959434 -0.0961817 1.84352 0.288545 2.38897L5.10807 9.21396C5.87766 10.3037 7.12465 10.3033 7.89375 9.213L12.7115 2.38394C13.0962 1.83849 13.0962 0.954406 12.7115 0.408956C12.3268 -0.136354 11.703 -0.136354 11.3183 0.408956L7.19479 6.25404C6.81009 6.79938 6.1864 6.79938 5.80161 6.25404L1.68174 0.414124C1.29702 -0.131327 0.673262 -0.131327 0.288545 0.414124Z" fill="black"/>
								</svg>


							</div>
						</button>

					</div>
					 

				</div>
			</div>	


			<div ref={services} className='our__services'>
				<div className='service__circle'></div>
				<div className='service__circle'></div>
				<div className='service__circle'></div>
				<svg className='svg__service' width="571" height="269" viewBox="0 0 571 269" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path fillRule="evenodd" clipRule="evenodd" d="M22.1055 21.1047V0H23.1055V21.1038L97.1055 21.0349V0H98.1055V21.034L172.106 20.9651V0H173.106V20.9642L247.106 20.8954V0H248.106V20.8944L269 20.875L269.001 21.875L248.106 21.8944V95.8945L269.07 95.875L269.071 96.875L248.106 96.8945V170.894L269.139 170.875L269.14 171.875L248.106 171.894V245.894L269.209 245.875L269.21 246.875L248.106 246.894V269H247.106V246.895L173.106 246.964V269H172.106V246.965L98.1055 247.034V269H97.1055V247.035L23.1055 247.104V269H22.1055V247.105L0.210281 247.125L0.209351 246.125L22.1055 246.105V172.105L0.140457 172.125L0.139526 171.125L22.1055 171.105V97.1047L0.0707545 97.1252L0.0698242 96.1252L22.1055 96.1047V22.1047L0.000930261 22.1252L0 21.1252L22.1055 21.1047ZM247.106 171.895V245.895L173.106 245.964V171.964L247.106 171.895ZM172.106 171.965V245.965L98.1055 246.034V172.034L172.106 171.965ZM97.1055 172.035V246.035L23.1055 246.104V172.104L97.1055 172.035ZM23.1055 171.104L97.1055 171.035V97.035L23.1055 97.1038V171.104ZM98.1055 171.034L172.106 170.965V96.9652L98.1055 97.034V171.034ZM173.106 170.964L247.106 170.895V96.8954L173.106 96.9643V170.964ZM247.106 21.8954V95.8954L173.106 95.9643V21.9642L247.106 21.8954ZM172.106 21.9651V95.9652L98.1055 96.034V22.034L172.106 21.9651ZM97.1055 22.0349V96.035L23.1055 96.1038V22.1038L97.1055 22.0349ZM323.106 21.1047V0H324.106V21.1038L398.106 21.0349V0H399.106V21.034L473.106 20.9651V0H474.106V20.9642L548.106 20.8954V0H549.106V20.8944L570 20.875L570.001 21.875L549.106 21.8944V95.8945L570.07 95.875L570.071 96.875L549.106 96.8945V170.894L570.139 170.875L570.14 171.875L549.106 171.894V245.894L570.209 245.875L570.21 246.875L549.106 246.894V269H548.106V246.895L474.106 246.964V269H473.106V246.965L399.106 247.034V269H398.106V247.035L324.106 247.104V269H323.106V247.105L301.21 247.125L301.209 246.125L323.106 246.105V172.105L301.14 172.125L301.14 171.125L323.106 171.105V97.1047L301.071 97.1252L301.07 96.1252L323.106 96.1047V22.1047L301.001 22.1252L301 21.1252L323.106 21.1047ZM548.106 171.895V245.895L474.106 245.964V171.964L548.106 171.895ZM473.106 171.965V245.965L399.106 246.034V172.034L473.106 171.965ZM398.106 172.035V246.035L324.106 246.104V172.104L398.106 172.035ZM324.106 171.104L398.106 171.035V97.035L324.106 97.1038V171.104ZM399.106 171.034L473.106 170.965V96.9652L399.106 97.034V171.034ZM474.106 170.964L548.106 170.895V96.8954L474.106 96.9643V170.964ZM548.106 21.8954V95.8954L474.106 95.9643V21.9642L548.106 21.8954ZM473.106 21.9651V95.9652L399.106 96.034V22.034L473.106 21.9651ZM398.106 22.0349V96.035L324.106 96.1038V22.1038L398.106 22.0349Z" fill="url(#paint0_radial_72_4)"/>
					<path d="M290.372 61.0211L284.248 49.7301L281.521 49.3296L280.027 59.5017L277.343 59.1076L280.598 36.9453L283.282 37.3395L281.87 46.9489L283.039 47.1205L293.324 38.8143L296.527 39.2847L286.136 47.7081L293.575 61.4915L290.372 61.0211Z" fill="white"/>
					<path d="M302.722 65.566C301.749 65.1362 300.946 64.5627 300.314 63.8455C299.685 63.1216 299.291 62.3065 299.133 61.3999C298.978 60.4867 299.122 59.5298 299.563 58.5292C299.952 57.6486 300.44 57.0113 301.028 56.6173C301.62 56.2167 302.274 55.9876 302.993 55.9302C303.712 55.8727 304.455 55.9218 305.224 56.0775C306.001 56.2294 306.768 56.4161 307.523 56.6377C308.51 56.9297 309.307 57.1738 309.914 57.3698C310.53 57.5621 311.006 57.6405 311.34 57.6048C311.681 57.572 311.936 57.3655 312.104 56.9853L312.139 56.9052C312.575 55.9179 312.643 55.0315 312.344 54.246C312.052 53.4635 311.362 52.8324 310.274 52.3525C309.147 51.8551 308.154 51.7119 307.296 51.923C306.438 52.134 305.755 52.4624 305.247 52.9079L303.359 51.1184C304.171 50.361 305.026 49.8694 305.923 49.6434C306.829 49.4137 307.725 49.3705 308.61 49.514C309.505 49.6538 310.339 49.8944 311.113 50.2358C311.606 50.4537 312.147 50.7639 312.734 51.1666C313.331 51.5655 313.851 52.0776 314.292 52.7027C314.74 53.3308 315.004 54.0968 315.083 55.0005C315.163 55.9043 314.933 56.9666 314.395 58.1874L309.926 68.3141L307.565 67.2721L308.483 65.1907L308.363 65.1377C308.056 65.4007 307.631 65.6398 307.09 65.8552C306.549 66.0706 305.909 66.1749 305.171 66.168C304.432 66.1611 303.616 65.9604 302.722 65.566ZM304.019 63.6035C304.953 64.0156 305.821 64.1795 306.623 64.0952C307.432 64.0138 308.128 63.755 308.711 63.3189C309.301 62.8857 309.737 62.3488 310.02 61.7084L310.973 59.547C310.82 59.6229 310.551 59.6358 310.167 59.5858C309.792 59.532 309.369 59.4447 308.896 59.3238C308.433 59.1991 307.983 59.0723 307.546 58.9431C307.118 58.8103 306.77 58.7046 306.502 58.6261C305.853 58.4353 305.222 58.3123 304.609 58.2569C304.005 58.1978 303.462 58.2729 302.979 58.4823C302.506 58.6879 302.137 59.0909 301.872 59.6913C301.51 60.5118 301.539 61.2662 301.961 61.9543C302.392 62.6387 303.078 63.1885 304.019 63.6035Z" fill="white"/>
					<path d="M314.761 71.265L324.944 57.9029L326.997 59.4675L322.569 65.2786L323.926 66.3129L333.156 64.1613L335.801 66.1767L325.502 68.5038L325.688 79.5918L323.043 77.5764L322.955 68.598L321.11 67.1925L316.814 72.8296L314.761 71.265Z" fill="white"/>
					<path d="M331.961 87.5391C331.01 86.3573 330.458 85.0941 330.303 83.7497C330.152 82.4109 330.381 81.0847 330.991 79.7713C331.604 78.4635 332.587 77.2657 333.94 76.178C335.303 75.0812 336.692 74.3709 338.107 74.0472C339.526 73.7292 340.874 73.7871 342.149 74.221C343.429 74.6606 344.544 75.4713 345.495 76.6531C346.446 77.8349 346.996 79.0952 347.146 80.434C347.301 81.7785 347.069 83.1069 346.45 84.4193C345.835 85.7373 344.846 86.9448 343.482 88.0416C342.13 89.1293 340.747 89.8299 339.333 90.1433C337.924 90.4625 336.58 90.4023 335.3 89.9627C334.025 89.5288 332.912 88.7209 331.961 87.5391ZM333.768 86.0858C334.49 86.9835 335.314 87.5371 336.24 87.7464C337.167 87.9558 338.117 87.8981 339.091 87.5732C340.065 87.2484 340.989 86.734 341.864 86.0303C342.739 85.3265 343.443 84.5314 343.974 83.6452C344.506 82.759 344.772 81.8387 344.772 80.8844C344.771 79.9301 344.41 79.0041 343.688 78.1064C342.966 77.2087 342.139 76.6574 341.207 76.4526C340.275 76.2479 339.319 76.3102 338.339 76.6396C337.36 76.969 336.433 77.4856 335.558 78.1894C334.683 78.8932 333.982 79.6859 333.456 80.5676C332.93 81.4492 332.67 82.3649 332.676 83.3146C332.682 84.2644 333.046 85.1881 333.768 86.0858Z" fill="white"/>
					<path d="M344.135 98.5187L359.295 100.641L360.503 103.36L345.149 110.18L344.102 107.821L355.977 102.546L340.834 100.464L339.609 97.7047L354.962 90.8853L356.01 93.2443L344.135 98.5187ZM363.721 96.8088L364.698 99.0079C363.618 99.4874 362.569 99.5064 361.551 99.0649C360.533 98.6234 359.74 97.7629 359.172 96.4834C358.613 95.2239 358.51 94.0686 358.865 93.0174C359.223 91.9728 359.942 91.2108 361.021 90.7313L361.998 92.9304C361.478 93.1612 361.086 93.5073 360.82 93.9684C360.557 94.4363 360.581 95.0201 360.891 95.7198C361.202 96.4195 361.621 96.832 362.147 96.9572C362.676 97.0891 363.201 97.0396 363.721 96.8088Z" fill="white"/>
					<path d="M362.575 122.588L364.976 122.426L365.899 136.044L363.499 136.207L363.126 130.707L348.765 131.681L348.59 129.105L362.951 128.132L362.575 122.588Z" fill="white"/>
					<path d="M347.468 146.113C347.71 144.616 348.278 143.36 349.174 142.345C350.068 141.337 351.207 140.62 352.59 140.193C353.973 139.774 355.521 139.703 357.234 139.98C358.961 140.259 360.419 140.815 361.606 141.65C362.792 142.491 363.651 143.531 364.182 144.769C364.712 146.015 364.856 147.386 364.615 148.883C364.373 150.38 363.805 151.633 362.911 152.641C362.015 153.656 360.873 154.372 359.483 154.79C358.093 155.216 356.533 155.289 354.806 155.01C353.092 154.733 351.646 154.174 350.467 153.334C349.287 152.501 348.432 151.462 347.902 150.216C347.371 148.978 347.226 147.611 347.468 146.113ZM349.757 146.483C349.573 147.62 349.714 148.603 350.178 149.432C350.643 150.26 351.322 150.927 352.215 151.434C353.108 151.94 354.109 152.283 355.217 152.462C356.326 152.641 357.387 152.631 358.402 152.433C359.416 152.235 360.278 151.817 360.987 151.178C361.695 150.539 362.142 149.651 362.325 148.513C362.509 147.376 362.365 146.393 361.894 145.563C361.422 144.733 360.736 144.065 359.835 143.558C358.935 143.05 357.931 142.707 356.822 142.528C355.714 142.349 354.656 142.359 353.649 142.558C352.641 142.757 351.787 143.177 351.085 143.817C350.384 144.457 349.941 145.346 349.757 146.483Z" fill="white"/>
					<path d="M354.428 173.14L356.524 174.322L349.822 186.213L347.726 185.031L350.432 180.229L337.893 173.161L339.161 170.913L351.7 177.98L354.428 173.14Z" fill="white"/>
					<path d="M328.817 184.562C329.906 183.364 331.109 182.57 332.427 182.182C333.746 181.803 335.096 181.813 336.478 182.211C337.86 182.62 339.189 183.402 340.462 184.559C341.736 185.716 342.648 186.968 343.198 188.315C343.749 189.672 343.917 191.016 343.702 192.348C343.488 193.69 342.871 194.922 341.851 196.045C341.263 196.693 340.574 197.234 339.785 197.67C338.995 198.105 338.122 198.361 337.166 198.438C336.215 198.52 335.203 198.355 334.13 197.942C333.057 197.529 331.94 196.795 330.78 195.741L329.97 195.006L338.677 185.42L340.328 186.92L333.387 194.563C334.088 195.2 334.842 195.629 335.647 195.848C336.448 196.073 337.24 196.073 338.025 195.85C338.804 195.632 339.507 195.177 340.135 194.486C340.826 193.725 341.235 192.895 341.362 191.996C341.49 191.107 341.389 190.242 341.059 189.401C340.73 188.56 340.222 187.828 339.537 187.206L338.436 186.206C337.496 185.353 336.553 184.791 335.606 184.522C334.659 184.263 333.751 184.271 332.881 184.545C332.017 184.824 331.235 185.349 330.534 186.121C330.078 186.623 329.736 187.14 329.509 187.672C329.282 188.215 329.177 188.765 329.193 189.321C329.215 189.883 329.368 190.441 329.653 190.995L327.458 192.37C327.009 191.607 326.755 190.781 326.696 189.891C326.644 189.005 326.791 188.105 327.14 187.19C327.493 186.28 328.052 185.404 328.817 184.562Z" fill="white"/>
					<path d="M320.504 193.056L329.915 206.973L327.777 208.419L323.684 202.367L322.27 203.322L321.362 212.757L318.608 214.619L319.691 204.116L309.124 200.752L311.878 198.889L320.415 201.672L322.336 200.373L318.365 194.502L320.504 193.056Z" fill="white"/>
					<path d="M299.611 204.137C301.087 203.587 302.487 203.462 303.813 203.762C305.139 204.062 306.316 204.716 307.346 205.725C308.376 206.735 309.183 208.025 309.769 209.596C310.365 211.195 310.597 212.716 310.465 214.158C310.329 215.609 309.86 216.877 309.058 217.962C308.252 219.056 307.138 219.868 305.717 220.398C304.61 220.81 303.536 220.977 302.495 220.898C301.454 220.819 300.512 220.516 299.67 219.989C298.828 219.463 298.155 218.733 297.652 217.8L300.071 216.899C300.523 217.547 301.169 218.03 302.011 218.347C302.848 218.673 303.8 218.637 304.866 218.24C305.809 217.889 306.544 217.335 307.071 216.578C307.594 215.83 307.888 214.939 307.954 213.903C308.015 212.876 307.824 211.769 307.381 210.58C306.928 209.364 306.342 208.376 305.623 207.616C304.897 206.86 304.09 206.363 303.2 206.126C302.304 205.892 301.377 205.954 300.421 206.31C299.792 206.544 299.262 206.866 298.831 207.276C298.4 207.685 298.083 208.161 297.881 208.704C297.678 209.246 297.609 209.832 297.672 210.462L295.254 211.364C295.044 210.383 295.07 209.42 295.333 208.474C295.591 207.538 296.079 206.687 296.797 205.921C297.511 205.165 298.449 204.57 299.611 204.137Z" fill="white"/>
					<path d="M291.355 221.911L291.666 224.297L278.131 226.065L277.82 223.679L283.286 222.965L281.421 208.692L283.981 208.358L285.845 222.63L291.355 221.911Z" fill="white"/>
					<path d="M264.082 208.619L260.56 225.046L258.036 224.505L259.568 217.361L257.899 217.003L250.464 222.882L247.213 222.185L255.541 215.692L250.65 205.74L253.901 206.437L257.805 214.522L260.072 215.008L261.558 208.078L264.082 208.619Z" fill="white"/>
					<path d="M242.64 201.748C243.597 202.214 244.378 202.817 244.982 203.558C245.584 204.305 245.946 205.135 246.069 206.047C246.19 206.965 246.01 207.916 245.531 208.899C245.11 209.764 244.598 210.383 243.995 210.754C243.389 211.132 242.726 211.336 242.005 211.366C241.285 211.397 240.544 211.319 239.782 211.135C239.011 210.954 238.252 210.738 237.506 210.488C236.531 210.159 235.743 209.885 235.144 209.666C234.536 209.45 234.063 209.354 233.728 209.377C233.386 209.397 233.123 209.594 232.941 209.967L232.903 210.046C232.43 211.016 232.329 211.899 232.598 212.696C232.86 213.489 233.526 214.145 234.594 214.666C235.702 215.206 236.689 215.386 237.554 215.208C238.42 215.029 239.115 214.727 239.639 214.301L241.458 216.161C240.617 216.887 239.745 217.346 238.84 217.538C237.926 217.733 237.029 217.742 236.15 217.565C235.261 217.392 234.437 217.12 233.676 216.75C233.191 216.513 232.663 216.183 232.091 215.758C231.509 215.337 231.01 214.806 230.592 214.164C230.168 213.52 229.934 212.744 229.889 211.838C229.843 210.932 230.113 209.879 230.698 208.68L235.546 198.729L237.866 199.86L236.87 201.905L236.988 201.962C237.305 201.711 237.738 201.488 238.287 201.293C238.836 201.099 239.479 201.019 240.217 201.054C240.954 201.088 241.762 201.32 242.64 201.748ZM241.271 203.66C240.353 203.213 239.492 203.016 238.687 203.07C237.875 203.121 237.17 203.353 236.571 203.767C235.965 204.177 235.509 204.697 235.203 205.326L234.168 207.45C234.324 207.38 234.593 207.377 234.975 207.442C235.347 207.51 235.767 207.613 236.235 207.752C236.693 207.894 237.138 208.038 237.57 208.183C237.992 208.332 238.336 208.451 238.601 208.54C239.242 208.755 239.868 208.902 240.479 208.98C241.08 209.062 241.626 209.008 242.116 208.817C242.597 208.629 242.981 208.24 243.268 207.65C243.661 206.844 243.66 206.089 243.265 205.386C242.86 204.685 242.195 204.11 241.271 203.66Z" fill="white"/>
					<path d="M230.835 195.605L220.16 208.578L218.167 206.938L222.81 201.296L221.492 200.212L212.188 202.018L209.62 199.905L219.999 197.964L220.227 186.877L222.795 188.989L222.548 197.965L224.338 199.438L228.842 193.965L230.835 195.605Z" fill="white"/>
					<path d="M214.254 178.701C215.16 179.917 215.665 181.2 215.77 182.549C215.87 183.893 215.591 185.209 214.933 186.499C214.271 187.783 213.244 188.943 211.852 189.98C210.449 191.025 209.034 191.683 207.608 191.954C206.178 192.218 204.834 192.11 203.575 191.629C202.313 191.142 201.229 190.29 200.323 189.074C199.417 187.857 198.914 186.577 198.814 185.234C198.709 183.884 198.991 182.565 199.659 181.277C200.322 179.983 201.356 178.813 202.76 177.768C204.151 176.732 205.56 176.083 206.984 175.823C208.404 175.557 209.745 175.667 211.008 176.154C212.266 176.635 213.348 177.484 214.254 178.701ZM212.394 180.085C211.706 179.161 210.903 178.577 209.985 178.334C209.067 178.09 208.116 178.112 207.13 178.4C206.145 178.689 205.202 179.168 204.301 179.839C203.4 180.509 202.668 181.277 202.103 182.143C201.539 183.009 201.239 183.919 201.204 184.872C201.168 185.826 201.495 186.765 202.183 187.689C202.871 188.613 203.677 189.195 204.6 189.434C205.524 189.674 206.482 189.647 207.473 189.354C208.464 189.062 209.41 188.58 210.311 187.91C211.211 187.239 211.941 186.473 212.5 185.611C213.058 184.75 213.352 183.845 213.382 182.895C213.411 181.946 213.082 181.01 212.394 180.085Z" fill="white"/>
					<path d="M202.502 167.277L187.432 164.585L186.328 161.823L201.927 155.586L202.885 157.983L190.82 162.807L205.874 165.458L206.994 168.261L191.395 174.498L190.437 172.101L202.502 167.277ZM182.866 168.249L181.972 166.014C183.069 165.576 184.118 165.596 185.118 166.076C186.119 166.555 186.879 167.445 187.399 168.745C187.91 170.025 187.969 171.183 187.575 172.22C187.178 173.25 186.431 173.985 185.334 174.423L184.441 172.189C184.969 171.978 185.375 171.647 185.658 171.196C185.938 170.739 185.936 170.154 185.652 169.443C185.368 168.732 184.965 168.304 184.444 168.159C183.92 168.008 183.394 168.037 182.866 168.249Z" fill="white"/>
					<path d="M184.978 142.502L182.573 142.575L182.16 128.931L184.565 128.858L184.732 134.368L199.119 133.933L199.197 136.513L184.81 136.949L184.978 142.502Z" fill="white"/>
					<path d="M200.945 119.623C200.647 121.11 200.033 122.344 199.1 123.325C198.169 124.299 197.005 124.974 195.606 125.349C194.209 125.716 192.66 125.73 190.958 125.39C189.242 125.047 187.806 124.436 186.651 123.558C185.497 122.673 184.677 121.602 184.192 120.345C183.709 119.081 183.616 117.706 183.913 116.218C184.21 114.731 184.824 113.501 185.755 112.527C186.687 111.546 187.855 110.872 189.26 110.506C190.665 110.132 192.226 110.117 193.942 110.46C195.644 110.8 197.068 111.412 198.215 112.296C199.364 113.172 200.18 114.243 200.663 115.507C201.148 116.764 201.242 118.136 200.945 119.623ZM198.671 119.168C198.897 118.039 198.793 117.051 198.36 116.206C197.926 115.361 197.273 114.669 196.399 114.13C195.525 113.591 194.537 113.211 193.436 112.991C192.335 112.771 191.274 112.741 190.253 112.902C189.232 113.062 188.356 113.448 187.623 114.06C186.891 114.672 186.412 115.543 186.187 116.673C185.961 117.803 186.068 118.791 186.509 119.637C186.949 120.484 187.61 121.177 188.491 121.718C189.372 122.258 190.363 122.639 191.464 122.859C192.565 123.079 193.623 123.108 194.636 122.946C195.65 122.785 196.52 122.397 197.245 121.783C197.97 121.17 198.445 120.298 198.671 119.168Z" fill="white"/>
					<path d="M195.012 92.3244L192.961 91.0652L200.104 79.4334L202.155 80.6925L199.27 85.39L211.536 92.9223L210.185 95.1219L197.919 87.5896L195.012 92.3244Z" fill="white"/>
					<path d="M221.032 81.8658C219.9 83.0227 218.668 83.7708 217.336 84.1101C216.004 84.4391 214.655 84.3789 213.289 83.9297C211.923 83.4701 210.625 82.6385 209.395 81.435C208.165 80.2314 207.3 78.9466 206.801 77.5804C206.301 76.2039 206.183 74.8543 206.447 73.5314C206.711 72.1982 207.374 70.9896 208.435 69.9056C209.047 69.2802 209.755 68.7646 210.56 68.3589C211.365 67.9531 212.247 67.7296 213.206 67.6883C214.159 67.6418 215.164 67.8449 216.221 68.2975C217.278 68.7502 218.367 69.5247 219.487 70.6212L220.269 71.3861L211.212 80.6418L209.617 79.0813L216.838 71.7017C216.161 71.0388 215.424 70.5827 214.627 70.3335C213.835 70.0791 213.043 70.049 212.251 70.2432C211.464 70.4322 210.745 70.8603 210.092 71.5273C209.373 72.2622 208.933 73.0765 208.773 73.9703C208.612 74.8537 208.681 75.7218 208.979 76.5745C209.277 77.4272 209.757 78.1774 210.418 78.8251L211.482 79.8655C212.388 80.7528 213.31 81.3487 214.247 81.6531C215.183 81.9472 216.091 81.9734 216.97 81.7319C217.844 81.4852 218.646 80.9893 219.375 80.244C219.849 79.7593 220.21 79.2553 220.457 78.7318C220.704 78.198 220.829 77.6527 220.833 77.0958C220.832 76.5337 220.7 75.9706 220.436 75.4062L222.681 74.1135C223.102 74.8927 223.325 75.7281 223.35 76.6199C223.37 77.5066 223.189 78.4006 222.806 79.3019C222.419 80.1981 221.828 81.0528 221.032 81.8658Z" fill="white"/>
					<path d="M229.65 73.6914L220.764 59.4337L222.955 58.0684L226.819 64.2691L228.267 63.3666L229.527 53.9727L232.348 52.214L230.874 62.6697L241.308 66.4255L238.486 68.1842L230.059 65.0848L228.092 66.3112L231.84 72.3262L229.65 73.6914Z" fill="white"/>
					<path d="M250.943 63.4002C249.447 63.8942 248.043 63.9666 246.729 63.6172C245.416 63.2678 244.264 62.5695 243.273 61.5222C242.282 60.475 241.523 59.1552 240.997 57.5628C240.462 55.9426 240.287 54.4146 240.473 52.9785C240.664 51.5333 241.181 50.2838 242.023 49.2299C242.869 48.1669 244.013 47.3975 245.453 46.9218C246.575 46.5513 247.654 46.425 248.691 46.5431C249.729 46.6612 250.658 46.9992 251.48 47.5571C252.302 48.115 252.946 48.8696 253.414 49.8209L250.963 50.6305C250.536 49.9653 249.908 49.4586 249.079 49.1105C248.254 48.7532 247.302 48.753 246.222 49.1098C245.266 49.4254 244.511 49.9514 243.956 50.6878C243.405 51.415 243.077 52.2949 242.973 53.3277C242.874 54.3512 243.023 55.4653 243.421 56.67C243.828 57.9024 244.376 58.9115 245.066 59.6974C245.763 60.4809 246.551 61.0076 247.431 61.2775C248.318 61.545 249.246 61.5187 250.215 61.1985C250.852 60.9881 251.394 60.6863 251.84 60.2932C252.286 59.9001 252.621 59.4364 252.843 58.902C253.066 58.3677 253.158 57.7845 253.118 57.1526L255.569 56.3429C255.741 57.3303 255.679 58.2917 255.381 59.227C255.088 60.1532 254.568 60.9854 253.822 61.7235C253.079 62.4525 252.12 63.0114 250.943 63.4002Z" fill="white"/>
					<path d="M259.861 45.9504L259.638 43.5544L273.23 42.2922L273.453 44.6881L267.964 45.1979L269.295 59.5299L266.724 59.7686L265.393 45.4366L259.861 45.9504Z" fill="white"/>
					<defs>
					<radialGradient id="paint0_radial_72_4" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(285.105 134.5) rotate(92.1473) scale(269.689 571.672)">
					<stop stopColor="#1F5D6C"/>
					<stop offset="1" stopColor="white" stopOpacity="0"/>
					</radialGradient>
					</defs>
					</svg>

				<div className='percent__services'>
					<svg className='percent__corner' width="37" height="39" viewBox="0 0 37 39" fill="none" xmlns="http://www.w3.org/2000/svg">
						<line y1="1.5" x2="37" y2="1.5" stroke="#1F5D6C" strokeWidth="2"/>
						<line x1="1.0061" y1="39" x2="1.0061" y2="2" stroke="#1F5D6C" strokeWidth="2"/>
					</svg>
					<svg className='percent__cornerTw' width="37" height="39" viewBox="0 0 37 39" fill="none" xmlns="http://www.w3.org/2000/svg">
						<line x1="37" y1="37.5" y2="37.5" stroke="#1F5D6C" strokeWidth="2"/>
						<line x1="35.994" x2="35.994" y2="37" stroke="#1F5D6C" strokeWidth="2"/>
					 </svg>
					 <svg className='percent__line' width="298" height="88" viewBox="0 0 298 88" fill="none" xmlns="http://www.w3.org/2000/svg">
						<line y1="-0.5" x2="225.976" y2="-0.5" transform="matrix(-1 0 0 1 298 1)" stroke="#1F5D6C"/>
						<line y1="-0.5" x2="84.516" y2="-0.5" transform="matrix(-0.639147 0.769085 0.69822 0.715883 72.0242 1)" stroke="#1F5D6C"/>
						<path d="M0.500015 75.5C0.500015 82.1781 5.36275 87.5 11.2538 87.5C17.1448 87.5 22.0076 82.1781 22.0076 75.5C22.0076 68.8219 17.1448 63.5 11.2538 63.5C5.36275 63.5 0.500015 68.8219 0.500015 75.5Z" stroke="#1F5D6C"/>
						<ellipse cx="5.85196" cy="6.5" rx="5.85196" ry="6.5" transform="matrix(-1 0 0 1 17.1057 69)" fill="#1F5D6C"/>
						</svg>

					
					<div className='percent__stat'>
						<div className='percent__item'>
							<h6>
								130<span>+</span>
							</h6>
							<p>Успешных Консультаций</p>
						</div>
						<div className='percent__item'>
							<h6>
								75<span>+</span>
							</h6>
							<p>Положительных Отзывов</p>
						</div>
					</div>
					<svg className='line__static' width="421" height="11" viewBox="0 0 421 11" fill="none" xmlns="http://www.w3.org/2000/svg">
						<line y1="1.25" x2="420.034" y2="1.25" stroke="#1F5D6C" strokeWidth="2"/>
						<rect x="0.012085" y="2" width="32" height="9" fill="#1F5D6C"/>
					</svg>
					<div className='percent__stat'>
						<div className='percent__item'>
							<h6>
								130<span>+</span>
							</h6>
							<p>Успешных Консультаций</p>
						</div>
						<div className='percent__item'>
							<h6>
								75<span>+</span>
							</h6>
							<p>Положительных Отзывов</p>
						</div>
					</div>
				</div>
				<div className='percent__services_imgs'>
					<h6>Наши Услуги</h6>
					<ItemServices />
				 
					{/* <div className='percent__items_serviceTw'>
						<div className='percent__item_service'>
							<img width='330px' src={serviceOne} alt="serviceOne" />
						</div>
						<div className='percent__item_service'>
							<img width='330px' src={serviceOne} alt="serviceOne" />
						</div>
						<div className='percent__item_service'>
							<img width='330px' src={serviceOne} alt="serviceOne" />
						</div>
					</div> */}
				</div>
		 
			</div>

			<div ref={reviews} className='reviews'>
				 <NewsReviews />
			</div>


			<div ref={send} className="cont">
				<div className='welcome__title_description shadow cont__shadow'>
				</div>
				<div className="cont__container">
					<div>


					</div>

					<div className='cont__content'>
					 
						<div className='cont__container_wrapper'>
							<h6>Связаться с Нами</h6>
							<div className='cont__inputs'>
								<input type="text" placeholder='Ваше Имя' />
								<input type="text" placeholder='Ваш Номер Телефона' />
							</div>
							 
							<textarea placeholder='Опишите Проблему'>


							</textarea>

							<button>ОТПРАВИТЬ СООБЩЕНИЕ</button>
							<svg className='corner__cont' width="38" height="39" viewBox="0 0 38 39" fill="none" xmlns="http://www.w3.org/2000/svg">
								<line x1="37.0135" y1="37.5137" x2="3.8147e-05" y2="37.5137" stroke="#1F5D6C" strokeWidth="2"/>
								<line x1="36.0068" y1="0.000244141" x2="36.0068" y2="37.0138" stroke="#1F5D6C" strokeWidth="2"/>
							</svg>
							<svg className='corner__cont_up' width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
								<line y1="1.5" x2="37.0135" y2="1.5" stroke="#1F5D6C" strokeWidth="2"/>
								<line x1="1.00684" y1="39.0134" x2="1.00684" y2="1.99992" stroke="#1F5D6C" strokeWidth="2"/>
							</svg>

						</div>
					</div>

				</div>


			</div>

			<div ref={map} className='map'>
				<h6>Мы на карте</h6>

			 <iframe src="https://yandex.ru/map-widget/v1/org/medclinic/68593172465/?ll=44.645030%2C43.049038&z=17" width="100%" height="600" frameBorder="1" allowFullScreen={true}  ></iframe> 


			</div>

		</section>
		 
 
	</section>
  );
}

export default Main;
